package inflearn;

public class infHowto {
    public static void main(String[] args) {
        /*
        1) 문제 이해하기
        2) 접근 방법
        3) 코드 설계
        4) 코드 구현

        문제 해석 후 접근 방법
        1. 직관적으로 생각
            ㄴ 보통 완전 탐색으로 시작
            ㄴ 문제 상황을 단순화 하여 생각하기(리스트 크기를 줄여 생각해보기 등)
            ㄴ 문제 상황을 극환하 하여 생각하기(리스트 크기를 범위 최대로 생각해보기 등)
        2. 자료구조와 알고리즘 활용(정렬은 O(nlogn))
            ㄴ 1.에서 파악한 내용을 토대로 어떤 자료구조를 사용하는게 가장 적합한지 결정
            ㄴ 대놓고 특정 자료구조와 알고리즘을 묻는 문제도 많음
            ㄴ 자료구조에 따라 선택할 수 있는 알고리즘을 문제에 적용
        3. 메모리 사용
            ㄴ 시간복잡도를 줄이기 위해 메모리를 사용하는 방법
            ㄴ 대표적으로 해시 테이블이 있음.
         */
    }
}
